pennam/ArduinoCore-zephyr/boards.txt
menu.debug=Debug
menu.link_mode=Link mode
menu.flash_mode=Flash mode

##########################################################################################

unoq.name=Arduino UNO Q
unoq.build.core=arduino
unoq.build.crossprefix=arm-zephyr-eabi-
unoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

unoq.menu.link_mode.dynamic=Dynamic
unoq.menu.link_mode.static=Static
unoq.menu.link_mode.static.build.link_mode=static
unoq.menu.link_mode.static.upload.extension=bin-zsk.bin

unoq.menu.flash_mode.flash=Flash
unoq.menu.flash_mode.flash.openocd_cfg=flash_sketch.cfg
unoq.menu.flash_mode.ram=RAM
unoq.menu.flash_mode.ram.openocd_cfg=flash_sketch_ram.cfg

unoq.build.zephyr_target=b_u585i_iot02a
unoq.build.zephyr_args=
unoq.build.variant=b_u585i_iot02a_stm32u585xx
unoq.build.mcu=cortex-m33
unoq.build.fpu=-mfpu=fpv5-sp-d16
unoq.build.architecture=cortex-m33
unoq.compiler.zephyr.arch.define=

unoq.build.float-abi=-mfloat-abi=hard
unoq.build.extra_flags=
unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unoq.build.board=UNO_Q
unoq.build.zephyr_hals=hal_stm32
unoq.compiler.zephyr.arch.define=
unoq.compiler.zephyr=
unoq.vid.0=0x2341
unoq.pid.0=0x0078
unoq.upload_port.0.vid=0x2341
unoq.upload_port.0.pid=0x0078
unoq.upload.address=0x80F0000
unoq.upload.target=stm32u585zitxq

unoq.upload.tool=remoteocd
unoq.upload.tool.default=remoteocd
unoq.upload.tool.network=remoteocd_network
unoq.upload.protocol=
unoq.upload.transport=
unoq.upload.vid=0x2341
unoq.upload.pid=0x0078
unoq.upload.interface=0
unoq.upload.use_1200bps_touch=false
unoq.upload.wait_for_upload_port=false
unoq.upload.native_usb=true
unoq.upload.maximum_size=1966080
unoq.upload.maximum_data_size=523624

unoq.bootloader.tool=remoteocd
unoq.bootloader.tool.default=remoteocd
unoq.bootloader.file=zephyr-{build.variant}.elf
unoq.bootloader.target=stm32u585zitxq

##########################################################################################
